Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector Class
 Get or set selected analysis objects in model views.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.UI.AnalysisObjectSelector
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisObjectSelector
Public NotInheritable Class AnalysisObjectSelector
The AnalysisObjectSelector type exposes the following members.
Constructors
Name | Description
AnalysisObjectSelector
 Initializes a new instance of the AnalysisObjectSelector class.
Top
Methods
Name | Description
GetSelectedObjects
 Get the analysis objects selected in model views.
SetSelectedObjects
 Set analysis objects as selected in model views.
Top
See Also
Reference
Tekla.Structures.Analysis.UI Namespace